<?php

$config['server']['db_host'] = 'localhost';
$config['server']['db_user'] = '';
$config['server']['db_pass'] = '';
$config['server']['db_name'] = 'mychat';

$config['server']['vkdata_url'] = '';

$config['server']['pidfile_on']                 = ABSPATH.'pid/on.pid';
$config['server']['pidfile_off']                = ABSPATH.'pid/off.pid';
$config['server']['logfile']                    = ABSPATH.'log/server_log.html';
$config['server']['log']                        = ABSPATH.'log/log.txt';
$config['server']['error_log']                  = ABSPATH.'log/error_log.txt';
$config['server']['domain']                     = '';
$config['server']['uploadUrl']                  = '';
$config['server']['host']                       = '127.0.0.1';
$config['server']['port']                       = 8889;
$config['server']['max_connections_from_ip']    = 7;

$config['chat']['logfile']  = ABSPATH.'log/chat_log.html';

$config['server']['monkeys'] = array(
    'обыкновенный тупайя',
    'карликовый тупайя',
    'тупайя тана',
    'индийский тупайя',
    'филипинский тупайя',
    'тупайя',
    'перохвостый тупайя',
    'кошачий лемур',
    'чёрный лемур',
    'мангустовый лемур',
    'воротничковый вари',
    'серый гапалемур',
    'изящный лемур',
    'карликовый лемур',
    'толстохвостый лемур',
    'мышиный микроцебус',
    'беличий лемур',
    'карликовый фанер',
    'короткохвостый индри',
    'длинношерстный авагис',
    'лиханотус',
    'диадемовый сифака',
    'белолобый индри',
    'сифака Верро',
    'хохлатый индри',
    'малагаскарская руконожка',
    'тонкий лори',
    'медленный лори',
    'куканг',
    'калабарский потто',
    'медвежий макки',
    'обыкновенный потто',
    'обыкновенный галаго',
    'толстохвостый галаго',
    'сенегальский галаго',
    'кустарниковый галаго',
    'западный галаго',
    'галаго Демидова',
    'банканский долгопят',
    'западный долгопят',
    'восточный долгопят',
    'маки-домовой',
    'филипинский долгопят',
    'сирихта',
    'обыкновенная игрунка',
    'уистити',
    'карликовая игрунка',
    'обыкновенный тамарин',
    'чёрный тамарин',
    'хохлатый тамарин',
    'эдиповый тамарин',
    'пегий тамарин',
    'обыкновенный капуцин',
    'белогрудый капуцин',
    'капуцин-плакса',
    'скулящий капуцин',
    'белолобый капуцин',
    'фави',
    'бурый капуцин',
    'беличьи саймири',
    'дурукули трёхполосый',
    'белоголовый саки',
    'саки-монах',
    'настоящая мартышка',
    'зелёная мартышка',
    'карликовая мартышка',
    'талапойн',
    'яванский макак',
    'макак-крабоед',
    'макака-резус',
    'бундер',
    'японский макак',
    'цейлонский макак',
    'китайский макак',
    'орангутанг',
    'шимпанзе',
    'горилла',
    'гиббон',
);
